---
kind: property
id: P:Autodesk.Revit.UI.ButtonData.Image
source: html/2192e909-e045-10f7-2213-86a09a6d3536.htm
---
# Autodesk.Revit.UI.ButtonData.Image Property

The image of the button.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the button if it is a part of a stacked set, or if it is promoted to the
Quick Access Toolbar. The best size is 16 x 16 pixels; if larger, the image will NOT be adjusted to fit the
toolbar button.